{
    "id": "article-magazine-layout",
    "html": "\n<section class=\"article-magazine-section\" data-ai-id=\"element-placeholder\">\n    <div class=\"container\">\n        <h1 class=\"anim-fade-in-up\">{{t:title}}</h1>\n        <div class=\"article-body anim-fade-in-up anim-delay-1\">\n            <p>{{t:p1}}</p>\n            <p>{{t:p2}}</p>\n            <p>{{t:p3}}</p>\n        </div>\n    </div>\n</section>",
    "css": "\n.article-magazine-section { padding: 4rem 0; }\n.article-magazine-section .container { max-width: 900px; margin: 0 auto; padding: 0 1rem; }\n.article-magazine-section h1 { font-size: 3rem; text-align: center; margin-bottom: 2.5rem; font-family: serif; }\n.article-magazine-section .article-body { column-count: 2; column-gap: 2.5rem; }\n.article-magazine-section .article-body p { line-height: 1.7; margin-top: 0; margin-bottom: 1.5rem; color: var(--color-secondary); }\n@media (max-width: 640px) { .article-magazine-section .article-body { column-count: 1; } }\n.article-magazine-section .anim-delay-1 { animation-delay: 0.1s; }\n",
    "translations": {
        "en": { "name": "Magazine Layout", "title": "A Modern Chronicle", "p1": "This is placeholder text. Using CSS columns can create a sophisticated, magazine-like reading experience. It's best suited for text-heavy articles where you want to fit more content into a smaller vertical space.", "p2": "This technique helps in making dense information feel less intimidating to the reader. Ensure your line length isn't too short, which can happen on smaller screens.", "p3": "The layout automatically reflows into a single column on smaller devices for optimal mobile readability, ensuring a great experience on all screen sizes." },
        "de": { "name": "Magazin-Layout", "title": "Eine moderne Chronik", "p1": "Dies ist ein Platzhaltertext. Die Verwendung von CSS-Spalten kann ein anspruchsvolles, magazinähnliches Leseerlebnis schaffen. Es eignet sich am besten für textlastige Artikel, bei denen Sie mehr Inhalt auf kleinerem vertikalen Raum unterbringen möchten.", "p2": "Diese Technik hilft, dichte Informationen für den Leser weniger einschüchternd wirken zu lassen. Stellen Sie sicher, dass Ihre Zeilenlänge nicht zu kurz wird, was auf kleineren Bildschirmen passieren kann.", "p3": "Das Layout fließt auf kleineren Geräten automatisch in eine einzige Spalte um, um eine optimale mobile Lesbarkeit zu gewährleisten und ein großartiges Erlebnis auf allen Bildschirmgrößen zu sichern." },
        "ar": { "name": "تخطيط المجلة", "title": "وقائع حديثة", "p1": "هذا نص نائب. يمكن أن يؤدي استخدام أعمدة CSS إلى إنشاء تجربة قراءة متطورة تشبه المجلات. إنه الأنسب للمقالات كثيفة النصوص حيث تريد احتواء المزيد من المحتوى في مساحة رأسية أصغر.", "p2": "تساعد هذه التقنية في جعل المعلومات الكثيفة تبدو أقل ترويعًا للقارئ. تأكد من أن طول الخط ليس قصيرًا جدًا ، وهو ما يمكن أن يحدث على الشاشات الأصغر.", "p3": "يتم إعادة تدفق التخطيط تلقائيًا إلى عمود واحد على الأجهزة الأصغر لضمان سهولة القراءة على الأجهزة المحمولة ، مما يضمن تجربة رائعة على جميع أحجام الشاشات." }
    }
}
