{
    "id": "article-two-column-text",
    "html": "\n<section class=\"article-two-column-section\" data-ai-id=\"element-placeholder\">\n    <div class=\"container\">\n        <h1>{{t:title}}</h1>\n        <div class=\"multi-column-content\">\n            <p>{{t:p1}}</p>\n            <p>{{t:p2}}</p>\n            <p>{{t:p3}}</p>\n        </div>\n    </div>\n</section>",
    "css": "\n.article-two-column-section { padding: 4rem 0; }\n.article-two-column-section .container { max-width: 900px; margin: 0 auto; padding: 0 1rem; }\n.article-two-column-section h1 { font-size: 3rem; text-align: center; margin-bottom: 2.5rem; }\n.article-two-column-section .multi-column-content { column-count: 2; column-gap: 2.5rem; }\n.article-two-column-section .multi-column-content p { text-align: justify; line-height: 1.7; margin-top: 0; color: var(--color-secondary); }\n@media (max-width: 640px) { .article-two-column-section .multi-column-content { column-count: 1; } }\n",
    "translations": {
        "en": { "name": "Two-Column Text", "title": "A Classic Read", "p1": "This is placeholder text. This two-column layout mimics a traditional newspaper or magazine, offering a classic and highly readable format for long-form content. It allows for more text to be visible on the screen at once without overwhelming the reader.", "p2": "Ensure that the column gap is sufficient to prevent the reader's eye from accidentally jumping between columns. This layout is best for text-heavy articles where imagery is secondary.", "p3": "On smaller screens, the content naturally reflows into a single column, preserving readability and providing a seamless mobile experience." },
        "de": { "name": "Zweispaltiger Text", "title": "Ein klassischer Lesestoff", "p1": "Dies ist ein Platzhaltertext. Dieses zweispaltige Layout ahmt eine traditionelle Zeitung oder ein Magazin nach und bietet ein klassisches und sehr lesbares Format für lange Inhalte. Es ermöglicht, dass mehr Text auf einmal auf dem Bildschirm sichtbar ist, ohne den Leser zu überfordern.", "p2": "Stellen Sie sicher, dass der Spaltenabstand ausreichend ist, um zu verhindern, dass das Auge des Lesers versehentlich zwischen den Spalten springt. Dieses Layout eignet sich am besten für textlastige Artikel, bei denen Bilder zweitrangig sind.", "p3": "Auf kleineren Bildschirmen fließt der Inhalt natürlich in eine einzige Spalte um, wodurch die Lesbarkeit erhalten bleibt und ein nahtloses mobiles Erlebnis geboten wird." },
        "ar": { "name": "نص من عمودين", "title": "قراءة كلاسيكية", "p1": "هذا نص نائب. يحاكي هذا التخطيط المكون من عمودين صحيفة أو مجلة تقليدية ، ويقدم تنسيقًا كلاسيكيًا وسهل القراءة للمحتوى الطويل. يسمح بعرض المزيد من النص على الشاشة دفعة واحدة دون إرباك القارئ.", "p2": "تأكد من أن فجوة العمود كافية لمنع عين القارئ من القفز بين الأعمدة عن طريق الخطأ. هذا التخطيط هو الأفضل للمقالات كثيفة النصوص حيث تكون الصور ثانوية.", "p3": "على الشاشات الأصغر ، يتم إعادة تدفق المحتوى بشكل طبيعي إلى عمود واحد ، مما يحافظ على سهولة القراءة ويوفر تجربة محمولة سلسة." }
    }
}